anthropic.claude-code
circleci.circleci
eamodio.gitlens
editorconfig.editorconfig
github.copilot-chat
github.vscode-github-actions
gruntfuggly.todo-tree
hashicorp.hcl
hashicorp.terraform
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.black-formatter
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
redhat.vscode-yaml
tim-koehler.helm-intellisense
usernamehw.errorlens
